# Задача: Написать программу, которая принимает на вход три числа и определяет, являются ли они пифагоровой тройкой.
# При этом использовать только базовые операции и условные операторы.

lst=[3,6,4]
lst.sort()
def answer(lst):
    for i in range(len(lst)):
        if lst[0]*lst[0]+lst[1]*lst[1]==lst[2]*lst[2]:
            print('Являетсвя пифагоровой тройкой')
            return True
        else:
            print('Не являетсвя пифагоровой тройкой')

answer(lst)