# Задача: Написать программу, которая принимает на вход строку и возвращает список всех уникальных слов в этой строке.
# При этом использовать только базовые операции, цикл for, функции и контейнерные типы данных.

input_str = input("Введите любую строку:")

lst_from_input = input_str.split()

uniq_worlds=set(lst_from_input)
print(uniq_worlds)