# Задача: Написать программу, которая использует глобальную переменную x и локальную переменную y.
# Присвоить переменной x значение 10, а переменной y - значение 5.
# Затем внутри функции изменить значение x на x*y и вернуть его. Вывести результат на экран.


x=10

def function():
    y=5
    global x
    x = x*y
print(x)
