# Задача: Написать программу, которая принимает на вход список строк и возвращает новый список, содержащий только те строки,
# которые начинаются с большой буквы.
# При этом использовать только базовые операции, цикл for, функции и контейнерные типы данных.


lst=["Apple", "Banana", "cherry"]
lst_upper=[]
for i in lst:
    if i[0].isupper():
        lst_upper.append(i)
print(lst_upper)
